Revit 2024 API
MaterialNode Methods
The MaterialNode type exposes the following members.
Methods
Name | Description
Dispose |  (Inherited from RenderNode.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAppearance
 Appearance properties associated with the material.
GetAppearanceOverride
 Returns appearance properties that override the preset appearance of the material.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
MaterialNode Class
Autodesk.Revit.DB Namespace